content/programming/notes/notes.org
#+startup: content indent

[[file:../../index.org][Giovanni's Diary]] > [[file:../programming.org][Programming]] >

* Public Notes
#+INDEX: Giovanni's Diary!Programming!Notes

I strongly believe information and education should be free and
available to everyone.

Here is a collection of some notes I took about subjects somewhat
related to computer science / programming:

- [[file:ml/intro-to-machine-learning.org][Introduction to Machine Learning]]
- [[file:fisica/fisica.org][Physics (Italian)]]
- [[file:algoritmi/algoritmi.org][Algorithms and Data Structures (Italian)]]

-----

Travel: [[file:../programming.org][Programming]], [[file:../../theindex.org][Index]]
