public/programming/notes/notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../programming.html">Programming</a> &gt;
</p>

<div id="outline-container-org57e4342" class="outline-2">
<h2 id="org57e4342">Public Notes</h2>
<div class="outline-text-2" id="text-org57e4342">
<p>
I strongly believe information and education should be free and
available to everyone.
</p>

<p>
Here is a collection of some notes I took about subjects somewhat
related to computer science / programming:
</p>

<ul class="org-ul">
<li><a href="ml/intro-to-machine-learning.html">Introduction to Machine Learning</a></li>
<li><a href="fisica/fisica.html">Physics (Italian)</a></li>
<li><a href="algoritmi/algoritmi.html">Algorithms and Data Structures (Italian)</a></li>
</ul>

<hr />

<p>
Travel: <a href="../programming.html">Programming</a>, <a href="../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
